Project5/app/views/applications/index.html.erb

  <% if current_user.affiliation == "Admin" %>
  <td><%= User.find(app.user_id.to_i).fname %> <%= User.find(app.user_id.to_i).lname %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]