Project5/app/views/applications/show.html.erb

  <strong>First Name:</strong>
  <%= User.find(curr_app.user_id.to_i).fname %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

  <strong>Last Name:</strong>
  <%= User.find(curr_app.user_id.to_i).lname %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

  <strong>Email:</strong>
  <%= User.find(curr_app.user_id.to_i).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

  <strong>Phone Number:</strong>
  <%= User.find(curr_app.user_id.to_i).phone_number %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]