Project5/app/controllers/applications_controller.rb

	def index
		@applicaions = Application.all
---
SELECT "applications".* FROM "applications"

	def edit
		@application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def update
		@application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def destroy
		Application.find(params[:id]).destroy
---
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 6]]
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

	def create
		@application = Application.create(application_params)
---
INSERT INTO "applications" ("course_number", "schedule", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)