Project5/app/controllers/matching_controller.rb

SELECT "courses".* FROM "courses" WHERE (course_number = '1110')
SELECT "applications".* FROM "applications" WHERE (course_number LIKE '%1110%')
---
def search
	@courseCandidateArray = []
	@arrayOfCourses = Course.where("course_number = '" + params[:searchCourse] + "'")
	@arrayOfCourses.each{|currentCourse|
		@applicantsFit = Application.where("course_number LIKE '%" + currentCourse[:course_number].to_s + "%'")