Project5/app/controllers/teaching_assistants_controller.rb

SELECT "teaching_assistants".* FROM "teaching_assistants"
---
	def index
		@tas = TeachingAssistant.all