Project5/app/views/teaching_assistants/index.html.erb

        <% if current_user.affiliation == "Admin" %>
          <td><%= User.find(ta.user_id.to_i).fname %> <%= User.find(ta.user_id.to_i).lname %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]